# Домашнее задание (объединения в pandas)
  
## Задание 1
  
Используйте файл с оценками фильмов ml-latest-small/ratings.csv. Посчитайте среднее время жизни пользователей, которые выставили более 100 оценок. Под временем жизни понимается разница между максимальным и минимальным значением столбца timestamp для данного значения userId.

In [40]:
import pandas as pd

In [67]:
ratings = pd.read_csv('ml-latest-small/ratings.csv')
ratings.head(50)

    userId  movieId  rating   timestamp
0        1       31     2.5  1260759144
1        1     1029     3.0  1260759179
2        1     1061     3.0  1260759182
3        1     1129     2.0  1260759185
4        1     1172     4.0  1260759205
5        1     1263     2.0  1260759151
6        1     1287     2.0  1260759187
7        1     1293     2.0  1260759148
8        1     1339     3.5  1260759125
9        1     1343     2.0  1260759131
10       1     1371     2.5  1260759135
11       1     1405     1.0  1260759203
12       1     1953     4.0  1260759191
13       1     2105     4.0  1260759139
14       1     2150     3.0  1260759194
15       1     2193     2.0  1260759198
16       1     2294     2.0  1260759108
17       1     2455     2.5  1260759113
18       1     2968     1.0  1260759200
19       1     3671     3.0  1260759117
20       2       10     4.0   835355493
21       2       17     5.0   835355681
22       2       39     5.0   835355604
23       2       47     4.0   835355552
24       2       50     4.0   835355586
25       2       52     3.0   835356031
26       2       62     3.0   835355749
27       2      110     4.0   835355532
28       2      144     3.0   835356016
29       2      150     5.0   835355395
30       2      153     4.0   835355441
31       2      161     3.0   835355493
32       2      165     3.0   835355441
33       2      168     3.0   835355710
34       2      185     3.0   835355511
35       2      186     3.0   835355664
36       2      208     3.0   835355511
37       2      222     5.0   835355840
38       2      223     1.0   835355749
39       2      225     3.0   835355552
40       2      235     3.0   835355664
41       2      248     3.0   835355896
42       2      253     4.0   835355511
43       2      261     4.0   835355681
44       2      265     5.0   835355697
45       2      266     5.0   835355586
46       2      272     3.0   835355767
47       2      273     4.0   835355779
48       2      292     3.0   835355492
49       2      296     4.0   835355395

In [68]:
ratings.groupby('userId').agg({'timestamp': ['min', 'max', 'count']})

         timestamp
               min         max count
userId
1       1260759108  1260759205    20
2        835355395   835356246    76
3       1298861589  1298932787    51
4        949778714   949982274   204
5       1163373044  1163375145   100
...            ...         ...   ...
667      847271220   847272234    68
668      993613196   993613478    20
669     1015829081  1015829766    37
670      938781328   940944033    31
671     1063500751  1074784735   115

[671 rows x 3 columns]

In [59]:
# отбираем пользователей с количеством оценок более 100
users = ratings.groupby('userId').count()
users = users[users.rating >= 100]
users.head()

        movieId  rating  timestamp
userId
4           204     204        204
5           100     100        100
8           116     116        116
15         1700    1700       1700
17          363     363        363

In [60]:
# собираем всё в одну таблицу таким образом, чтобы остались только те, у кого более 100 оценок
ratings_100 = users.merge(ratings, on='userId', how = 'left')
ratings_100.head()

   userId  movieId_x  rating_x  timestamp_x  movieId_y  rating_y  timestamp_y
0       4        204       204          204         10       4.0    949810645
1       4        204       204          204         34       5.0    949919556
2       4        204       204          204        112       5.0    949810582
3       4        204       204          204        141       5.0    949919681
4       4        204       204          204        153       4.0    949811346

In [62]:
# собираем сводную таблицу со временем
time = ratings_100.groupby('userId').agg(['min', 'max'])['timestamp_y']
time.head()

               min         max
userId
4        949778714   949982274
5       1163373044  1163375145
8       1154389340  1154474527
15       997937239  1469330735
17      1127468587  1127476640

In [63]:
# считаем среднее время
time['lifetime'] = time.apply(lambda x: x['max'] - x['min'], axis=1)
time['lifetime'].mean()

39331748.56653992

## Задание 2

Дана статистика услуг перевозок клиентов компании по типам (см. файл с кодом занятия). Необходимо сформировать две таблицы:  
* таблицу с тремя типами выручки для каждого client_id без указания адреса клиента
* аналогичную таблицу по типам выручки с указанием адреса клиента  

Обратите внимание, что в процессе объединения таблиц данные не должны теряться.

In [75]:
rzd = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115],
        'rzd_revenue': [1093, 2810, 10283, 5774, 981]
    }
)
rzd

   client_id  rzd_revenue
0        111         1093
1        112         2810
2        113        10283
3        114         5774
4        115          981

In [76]:
auto = pd.DataFrame(
    {
        'client_id': [113, 114, 115, 116, 117],
        'auto_revenue': [57483, 83, 912, 4834, 98]
    }
)
auto

   client_id  auto_revenue
0        113         57483
1        114            83
2        115           912
3        116          4834
4        117            98

In [77]:
air = pd.DataFrame(
    {
        'client_id': [115, 116, 117, 118],
        'air_revenue': [81, 4, 13, 173]
    }
)
air

   client_id  air_revenue
0        115           81
1        116            4
2        117           13
3        118          173

In [78]:
client_base = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115, 116, 117, 118],
        'address': ['Комсомольская 4', 'Энтузиастов 8а', 'Левобережная 1а', 'Мира 14', 'ЗЖБИиДК 1', 
                    'Строителей 18', 'Панфиловская 33', 'Мастеркова 4']
    }
)
client_base

   client_id          address
0        111  Комсомольская 4
1        112   Энтузиастов 8а
2        113  Левобережная 1а
3        114          Мира 14
4        115        ЗЖБИиДК 1
5        116    Строителей 18
6        117  Панфиловская 33
7        118     Мастеркова 4

In [88]:
# три типа выручки с адресами
full = (rzd
            .merge(auto, how='outer')
            .merge(air, how='outer')
            .merge(client_base, how='outer')
       )
full.head()

   client_id  rzd_revenue  auto_revenue  air_revenue          address
0        111       1093.0           NaN          NaN  Комсомольская 4
1        112       2810.0           NaN          NaN   Энтузиастов 8а
2        113      10283.0       57483.0          NaN  Левобережная 1а
3        114       5774.0          83.0          NaN          Мира 14
4        115        981.0         912.0         81.0        ЗЖБИиДК 1

In [92]:
# три типа выручки без адресов

revenue_full = full.drop(['address'], axis=1)
revenue_full.head()

   client_id  rzd_revenue  auto_revenue  air_revenue
0        111       1093.0           NaN          NaN
1        112       2810.0           NaN          NaN
2        113      10283.0       57483.0          NaN
3        114       5774.0          83.0          NaN
4        115        981.0         912.0         81.0

## Задание 3

В задаче сквозной аналитики вам предоставили данные по местоположению пользователей. Т. е. для каждого user_id известна последовательность координат (широта/долгота), когда они требовались приложению для полноценной работы. Как бы вы добавили эти сведения в таблицу визитов и покупок? Для составления ответа можно использовать вопросы:

*лучше добавить отдельной таблицей "ИД визита - широта - долгота"*
  
* У каждого пользователя известен набор координат. А для связывания с визитом или фактом покупки скорее всего потребуется одно-два числа. Как их получить?

*Координаты легко сделать числами, представив их в формате "Только градусы с десятичной дробной частью (54.97158, 73.38318)"*


* Наборы координат одного и того же пользователя могут быть значительно удалены друг от друга. Как это отразится на вопросе расчетах пункта 1?

*тут не понял вопроса*


* Какие дополнительные признаки можно получить из координат? Ведь это просто числа, которые сами по себе мало что дают.

*По координатам можно определять расстояния между какими либо действиями или место, в котором человек предпочитает совершать действия (к примеру, рекламу смотрел на работе, а покупку оформлял из дома, или если покупки оффлайновые, но требуют использования приложения (показать кассиру виртуальную карту) - можно выяснить в каких магазинах клиент предпочитает их делать). Можно добавить в БД пометки "любимый магазин" или "любимое место" (если речь идёт о такси - можно обогатить базу любимыми точками, из которых человек вызывает такси, и в какие ездит)*